#### 데이터 과학자가 판다스를 배우는 이유
    : 데이터 분석 업무의 80~90%는 데이터를 수집하고 정리하는 일이 차지한다고 한다.
    나머지 10~20%는 알고리즘을 선택하고, 모델링 결과를 분석하여 데이터로부터 유용한 정보를 뽑아내는 분석프로세스의 몫이다.

#### 판다스 자료구조
    시리즈: 1차원 배열
    데이터프레임: 2차원 배열
    
- 시리즈
    
    인덱스와 값의 일대일 대응

In [2]:
# 딕셔너리 -> 시리즈
import pandas as pd

dict_data = {"a": 1, "b": 2, "c": 3}

sr = pd.Series(dict_data)
print(type(sr),"\n")
print(sr)

<class 'pandas.core.series.Series'>

a    1
b    2
c    3
dtype: int64

In [6]:
# 인덱스 값을 지정 해 주지 않을 경우 인덱스는 (0~ )
list_data = ['2022-04-25', 3.14, 'ABC', 100, True]
sr = pd.Series(list_data)
sr

0    2022-04-25
1          3.14
2           ABC
3           100
4          True
dtype: object

In [14]:
# index와 value 추출
idx = sr.index
val = sr.values
print(idx,"\n",val)
print(type(val))

RangeIndex(start=0, stop=5, step=1)
 ['2022-04-25' 3.14 'ABC' 100 True]
<class 'numpy.ndarray'>

In [11]:
# 추가) 위 val은 한줄이어서 리스트인줄 알았지만 array구조였다.
dic={"a": [1,2,3], "b": [2,3,4], "c": [3,4,5]}
sr1 = pd.DataFrame(dic)
sr1.values

In [23]:
# 딕셔너리를 그대로 DataFrame에 넣자 오류가 뜬다, 인덱스값을 지정 해줘야함([]로 묶어서)
pd.DataFrame({"a":1,"b":2,"c":3}, index=['row_1'])

       a  b  c
row_1  1  2  3

In [24]:
# 튜플 -> 시리즈
tup_data = ("영인","2022-04-25","여",True)
sr = pd.Series(tup_data, index=["이름","생년월일","성별","학생여부"])
sr

이름              영인
생년월일    2022-04-25
성별               여
학생여부          True
dtype: object

In [30]:
# 인덱스를 이용하여 원소를 선택하는 방법
print("방법 1: 인덱스값 넣기 =",sr[0],"\n"+"방법 2: 인덱스 라벨 넣기 =",sr["이름"])

방법 1: 인덱스값 넣기 = 영인
방법 2: 인덱스 라벨 넣기 = 영인

In [37]:
# 여러 개의 인덱스를 "대괄호 안에" 리스트 형태로 입력
print(sr[[1,2]],"\n")
# 여러 개의 인덱스를 "대괄호 없이" 리스트 형태로 범위지정하여 입력
print(sr["이름":"학생여부"])

생년월일    2022-04-25
성별               여
dtype: object

이름              영인
생년월일    2022-04-25
성별               여
학생여부          True
dtype: object

- 데이터프레임
    - 행렬구조

In [3]:
# 딕셔너리 -> 데이터프레임 변환
dict_data = {"c0": [1,2,3], "c1": [4,5,6], "c2": [7,8,9]}

df = pd.DataFrame(dict_data)
print(type(df),"\n",df)

<class 'pandas.core.frame.DataFrame'>
    c0  c1  c2
0   1   4   7
1   2   5   8
2   3   6   9

In [4]:
# 행 인덱스/ 열 이름 설정
df = pd.DataFrame(
    [[15,'남','덕영중'],[17,'여','수리중']],
    index=['준서','예은'],
    columns=['나이','성별','학교']
)
print(df,"\n",df.index,"\n",df.columns)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중
 Index(['준서', '예은'], dtype='object')
 Index(['나이', '성별', '학교'], dtype='object')

In [5]:
# 행 인덱스/ 열 이름 변경하기
df.index = ['학생1','학생2']
df.columns = ['연령','남여','소속']
print(df,"\n",df.index,"\n",df.columns)

     연령 남여   소속
학생1  15  남  덕영중
학생2  17  여  수리중
 Index(['학생1', '학생2'], dtype='object')
 Index(['연령', '남여', '소속'], dtype='object')

In [6]:
# 행 인덱스/ 열 이름의 "일부"를 변경하기
# inplace=True : 원본데이터를 변경
df = pd.DataFrame(
    [[15,'남','덕영중'],[17,'여','수리중']],
    index=['준서','예은'],
    columns=['나이','성별','학교']
)
print(df,"\n")

df.rename(columns={'나이':'연령','성별':'남여','학교':'소속'},inplace=True)
df.rename(index={'준서':'학생1','예은':'학생2'}, inplace=True)
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

     연령 남여   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [7]:
# 행 삭제
exam_data = {'수학': [90, 80, 70], '영어': [98, 89, 95],
            '음악': [85 ,95, 100], '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
print(df,"\n")

df2 = df[:]
df2.drop('우현', inplace=True)
print(df2,"\n")

df3 = df[:]
df3.drop(['우현','인아'], axis=0, inplace=True)
print(df3)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

    수학  영어  음악   체육
서준  90  98  85  100

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_7800\2558806352.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop('우현', inplace=True)
C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_7800\2558806352.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.drop(['우현','인아'], axis=0, inplace=True)

In [9]:
# 열 삭제
exam_data = {'수학': [90, 80, 70], '영어': [98, 89, 95],
            '음악': [85 ,95, 100], '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
print(df,"\n")

df4 = df
df4.drop('수학', axis=1, inplace=True)
print(df4,"\n")

df5 = df
df5.drop(['영어', '음악'], axis=1, inplace=True)
print(df5)

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

     체육
서준  100
우현   90
인아   90

In [11]:
# 행 선택
# loc: 인덱스 이름
# iloc: 정수형 위치 인덱스
exam_data = {'수학': [90, 80, 70], '영어': [98, 89, 95],
            '음악': [85 ,95, 100], '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data, index=['서준','우현','인아'])
print(df,"\n")

label1 = df.loc['서준']
position1 = df.iloc[0]
print(label1,"\n",position1,"\n")

label2 = df.loc[['서준','우현']]
position2 = df.iloc[[0,1]]
print(label2,"\n",position2,"\n")

label3 = df.loc['서준':'우현']
position3 = df.iloc[0:1]
print(label3,"\n",position3,"\n")

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64
 수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
     수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90
     수학  영어  음악   체육
서준  90  98  85  100

In [12]:
# 열 선택
exam_data = {'이름': ['서준','우현','인아'],
            '수학': [90, 80, 70], '영어': [98, 89, 95],
            '음악': [85 ,95, 100], '체육': [100, 90, 90]}
df = pd.DataFrame(exam_data)
print(df,"\n")

math1 = df['수학']
print(type(math1),"\n")

english = df.영어
print(english,"\n")

music_gym = df[['음악','체육']]
print(music_gym,type(music_gym),"\n")

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

<class 'pandas.core.series.Series'>

0    98
1    89
2    95
Name: 영어, dtype: int64

    음악   체육
0   85  100
1   95   90
2  100   90 <class 'pandas.core.frame.DataFrame'>

범위 슬라이싱: df.iloc[ 시작인덱스 : 끝 인덱스 : 슬라이싱 간격 ]

In [13]:
df.iloc[::2]

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
2  인아  70  95  100   90

In [14]:
# 역순인덱싱은 간격에 -1 입력
df.iloc[::-1]

   이름  수학  영어   음악   체육
2  인아  70  95  100   90
1  우현  80  89   95   90
0  서준  90  98   85  100

In [16]:
# 원소 선택
df = pd.DataFrame(exam_data)
df.set_index('이름', inplace=True)

a = df.loc['서준','음악']
b = df.iloc[0, 2]
print(a,b,"\n")

c = df.loc['서준',['음악','체육']]
d = df.iloc[0,[2,3]]
e = df.loc['서준','음악':'체육']
f = df.iloc[0,2:4]
print(c,d,"\n\n",e,f)

85 85

음악     85
체육    100
Name: 서준, dtype: int64 음악     85
체육    100
Name: 서준, dtype: int64

 음악     85
체육    100
Name: 서준, dtype: int64 음악     85
체육    100
Name: 서준, dtype: int64

In [18]:
# 열 추가
print(df)
df['국어'] = 80
display(df)

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [20]:
# 행 추가: 겹치지 않는 인덱스값으로 선택하여 값을 넣는다
df = pd.DataFrame(exam_data)
df.loc[3] = 0
display(df)

df.loc[4] = ['동규',90,80,70,60]
display(df)

df.loc['행5'] = df.loc[3]
display(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
3   0   0   0    0    0
4  동규  90  80   70   60

    이름  수학  영어   음악   체육
0   서준  90  98   85  100
1   우현  80  89   95   90
2   인아  70  95  100   90
3    0   0   0    0    0
4   동규  90  80   70   60
행5   0   0   0    0    0

원소 값 변경: df[행][열] = 새로운 값

In [24]:
df = pd.DataFrame(exam_data)
df.set_index('이름', inplace=True)
print(df.loc['서준']['수학'])
print(df.iloc[0,0])
print(df.loc['서준',['음악','체육']])
df.iloc[0,[2,3]] = 5,10
print(df.loc['서준',['음악','체육']])

90
90
음악     85
체육    100
Name: 서준, dtype: int64
음악     5
체육    10
Name: 서준, dtype: int64

In [26]:
# 행/열 위치 바꾸기
df = pd.DataFrame(exam_data)
print(df)
df = df.transpose()
print(df)
df = df.T
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90
      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90   90
   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90